[
    {
        "url": "https://topdev.vn/viec-lam/it-support-o365-hn-english-fluent-night-shift-offer-up-to-24m-itechwx-company-limited-2035932?src=topdev_search&medium=searchresult",
        "job_title": "IT Support O365 - HN (English Fluent - Night shift - Offer up to 24M)",
        "company_name": "iTechwx Company Limited",
        "address": "Quận Đống Đa, Hà Nội",
        "skills": [
            "IT Support",
            "Technical Support",
            "Microsoft Dynamics 365"
        ],
        "address_long": "Forth office: Lancaster Luminaire Building, No. 1152-1154 Duong Lang,  Lang Thuong Ward, Dong Da Dist,  Ha Noi City/ Văn phòng 4: Tòa nhà Lancaster Luminaire, Số 1152-1154 Đường Láng, Phường Láng Thượng, Quận Đống Đa, Thành phố Hà Nội",
        "salary_min": null,
        "salary_max": null,
        "salary_currency": null,
        "posted_time": "1 tuần trước",
        "exp": "Không yêu cầu",
        "level": "Fresher, Junior, Middle",
        "job_type": "In Office",
        "contract_type": "Fulltime",
        "expired_time": "12 giờ tới",
        "content": "We are, iTechwx, established in mid-2022, with over 700 employees across 3 offices within Ho Chi Minh City and 1 office in Ha Noi City. iTechwx dedicates the One-Stop Digital Transformation Service to our customers. Renowned for delivering premium IT outsourcing services exclusively tailored for Microsoft clients for 4 products: Microsoft Dynamics 365, Microsoft Azure, Microsoft Windows Commercial, and Microsoft Office 365.\nAre you passionate about helping others and have a deep understanding of Microsoft Office 365?\nWe're seeking a talented Technical Support Engineer to join our growing team! In this role, you'll leverage your expertise in Microsoft Office 365 (M365) to troubleshoot and resolve customer issues, ensuring a smooth and successful user experience.",
        "RESPONSIBILITIES": "Review issues and contact customers to understand technical issues. Ensures customers stay informed as to the status/solution of their issue. Utilizes troubleshooting tools (e.g., event logs, and performance traces) to help resolve customer issues.\nResolves or escalates multiple and varied customer issues. Documents technical work and research.\nAnalyzes problems and develops solutions for customer needs using log analysis and other proprietary tools.\nCollaborates on cross-team and cross-product technical issues by working with resources from other groups as needed to resolve moderately complex customer issues.\nAttends readiness training and non-technical training to ensure that they become proficient in support topics.\nProduct/Process Improvement\nProvides feedback to improve products to more senior engineers or technical advisors.\nIdentifies potential defects and escalates to more senior engineers to resolve.\nUses automated tools to deliver solutions for a wide range of issues.\nProvides feedback on how to improve automated tools.\nAttends case triage meetings or case discussions to collaborate and share ideas to resolve problems.",
        "Requirements": "Communication & Interpersonal Skills:\nAdvanced English proficiency (equivalent to IELTS 6.5 or higher).\nOutstanding customer service skills, emphasizing empathy, patience, and active listening.\nProfessional Attributes:\nPassion for technology and a desire to learn and grow within the IT industry.\nStrong problem-solving and analytical skills.\nAbility to work independently and as part of a team.\nAdaptability and flexibility to work in a fast-paced environment.\nShift Availability: Available to work rotating shifts 24/5 or fixed nightshift as determined by the manager.\nWorking day: 5 shifts per week, and 2 flexible days off. Willing to work during Tet and holidays assigned by the manager.",
        "Recruitment Progress": "Vòng 1\nCommunication + English test\nVòng 2\nTechnical test",
        "BENEFIT": "Salary at 100% during the probationary period.\n90% contribution of the gross salary to social insurance.\nAn employee who works at night (10 PM -6 AM) will be paid an additional amount of 30% of the normal salary + PVI insurance + 500,000 VND food allowance.\n20 days leave (12 days of annual leave and 8 days of sick leave)\nFull working equipment will be provided.\nAnnual Health Checkup for employees who have worked for at least 6 months from the date of signing the official labor contract.\nActivities: Birthday party, Employee engagement activities."
    }
]